# SheetAssemblyTypeMark Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SheetAssemblyTypeMark Property
ParameterTypeId Class See Also
---
"Assembly: Type Mark"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SheetAssemblyTypeMark { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SheetAssemblyTypeMark As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SheetAssemblyTypeMark {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace